import numpy as np
import matplotlib.pyplot as plt
import japanize_matplotlib

fig = plt.figure()

plt.title("潜伏状態：E")
plt.grid()
plt.xlabel("経過日数[日]")
plt.ylabel("人数[人]")

x = np.linspace(0, 60, 61)
E1 = [   0,  16,  24,  40,  54,  68, 108, 147, 207, 243, 263,
           256, 212, 170, 138,  99,  68,  56,  46,  35,  23,  
            19,  11,   7,   4,   2,   0,   0,   0,   0,   0,
             0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
             0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
             0,   0,   0,   0,   0,   0,   0,   0,   0,   0]

E2 = [   0,  16,  24,  38,  52,  61, 106, 131, 169, 209, 232,
           195, 145, 114,  83,  72,  51,  49,  42,  37,  29,  
            21,  22,  21,  19,  17,  18,  15,  11,  10,   4,
             4,   4,   5,   5,   1,   1,   1,   1,   1,   0,
             0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
             0,   0,   0,   0,   0,   0,   0,   0,   0,   0]

E3 = [   0,  17,  25,  39,  53,  81, 115, 144, 129,  98,  81,
            56,  46,  39,  44,  45,  47,  42,  39,  34,  32,
            27,  18,  22,  21,  22,  18,  10,  13,  12,  11,
             8,   8,   6,   8,  11,  11,  10,  10,   9,   5,
             3,   4,   4,   4,   4,   4,   3,   2,   2,   1,
             2,   2,   1,   0,   1,   1,   0,   0,   0,   0]

E4 = [   0,  16,  24,  38,  57,  90,  85,  62,  59,  44,  38,
            30,  33,  36,  33,  33,  31,  27,  26,  25,  23,
            18,  15,  15,  14,  13,  11,  10,   9,   9,  11,
            10,  13,  10,  10,   9,   7,   5,   5,   4,   4,
             4,   1,   4,   5,   5,   5,   3,   4,   5,   3,
             4,   5,   4,   3,   3,   3,   3,   2,   4,   4]

plt.plot(x, E1, color="gold", label="外出自粛なし")
plt.plot(x, E2, color="gold", label="外出自粛あり(10日目以降)", linestyle="dashed")
plt.plot(x, E3, color="gold", label="外出自粛あり(7日目以降)", linestyle="dashdot")
plt.plot(x, E4, color="gold", label="外出自粛あり(5日目以降)", linestyle="dotted")

plt.legend()

plt.show()
fig.savefig("E.png")